NordicPlayground/nrf528xx-ble-throughput-demo/ble_app_att_mtu_throughput/main.c
    err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
    APP_ERROR_CHECK(err_code);
	
	if(m_board_role == BOARD_TESTER)
	{		
		memset(&opt, 0x00, sizeof(opt));
		
		opt.common_opt.conn_bw.role = BLE_GAP_ROLE_CENTRAL;
		
		if(status == true)
		{
			opt.common_opt.conn_bw.conn_bw.conn_bw_rx = BLE_CONN_BW_HIGH;
			opt.common_opt.conn_bw.conn_bw.conn_bw_tx = BLE_CONN_BW_HIGH;
		}
		else
		{
			opt.common_opt.conn_bw.conn_bw.conn_bw_rx = BLE_CONN_BW_LOW;
			opt.common_opt.conn_bw.conn_bw.conn_bw_tx = BLE_CONN_BW_LOW;
		}

		err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_BW, &opt);
		APP_ERROR_CHECK(err_code);
	}
	NRF_LOG_RAW_INFO("Setting connection event extension to %d\r\n", opt.common_opt.conn_evt_ext.enable);
}


void data_len_ext_set(test_params_t *params)
{
    ret_code_t err_code;
    ble_opt_t  opt;

	uint16_t pdu_size = params->data_len_ext_enabled ?
        (params->att_mtu + LL_HEADER_LEN) : BLE_GATT_MTU_SIZE_DEFAULT + LL_HEADER_LEN;
	
	if(pdu_size > 251)
	{
		pdu_size = 251;
	}
	
    memset(&opt, 0x00, sizeof(opt));
    opt.gap_opt.ext_len.rxtx_max_pdu_payload_size = pdu_size;

    err_code = sd_ble_opt_set(BLE_GAP_OPT_EXT_LEN, &opt);
    NRF_LOG_DEBUG("Setting DLE to %u\r\n", pdu_size);
    APP_ERROR_CHECK(err_code);
}

void tx_power_set(int8_t tx_power)
{
	uint32_t err_code;
	err_code = sd_ble_gap_tx_power_set(tx_power);
	APP_ERROR_CHECK(err_code);
}

void set_all_parameters(test_params_t *params)
{	
	gatt_mtu_set(params->att_mtu);
	
	m_conn_param.max_conn_interval = MSEC_TO_UNITS(params->conn_interval, UNIT_1_25_MS);
	m_conn_param.min_conn_interval = MSEC_TO_UNITS(params->conn_interval, UNIT_1_25_MS);
	
    data_len_ext_set(params);
    conn_evt_len_ext_set(params->conn_evt_len_ext_enabled);
    preferred_phy_set(params->rxtx_phy);
	tx_power_set(params->tx_power);
	
	amt_byte_transfer_count = params->transfer_data_size * 1024;
	m_transfer_data.kb_transfer_size = params->transfer_data_size;
	
	//TODO: Choose BLE version better (tx power = 8 should be which version for example)
	
	switch(params->rxtx_phy)
	{
		case BLE_GAP_PHY_2MBPS:
			params->link_budget = params->tx_power + 92;
			params->ble_version = "BLE 5 High Speed";
			break;
		case BLE_GAP_PHY_1MBPS:
			params->link_budget = params->tx_power + 96;
			if(params->data_len_ext_enabled || params->conn_evt_len_ext_enabled || (params->att_mtu > 23))
			{
				params->ble_version = "BLE 4.2";
			}
			else
			{
				params->ble_version = "BLE 4.1";
			}
			break;
		case BLE_GAP_PHY_CODED:
			params->link_budget = params->tx_power + 103;
			params->ble_version = "BLE 5 Long Range";
			break;
	}
}


void test_begin(bool continuous)
{
	m_test_continuous = continuous;
	
	m_transfer_data.last_throughput = 0;
	memset(&m_rssi_data, 0, sizeof(m_rssi_data));
	m_rssi_data.max = -128;
    m_rssi_data.range_multiplier_max = 500;
    m_print_menu = false;
	
    NRF_LOG_RAW_INFO("\r\n\r\n\r\nPreparing the test.\r\n");
    NRF_LOG_FLUSH();
	
	display_clear();

    if (m_board_role == BOARD_TESTER)
    {
        scan_start();
    }
    if (m_board_role == BOARD_DUMMY)
    {
        advertising_start();
    }
}

static bool is_test_ready()
{
    if (   (m_board_role == BOARD_TESTER)
        && m_conn_interval_configured
        && m_notif_enabled
        && m_mtu_exchanged
        && m_phy_updated
        && !m_run_test)
    {
        return true;
    }
    return false;
}

static void display_timer_handler(void *p_context)
{
	m_transfer_data.counter_ticks = counter_get();
	m_transfer_data.bytes_transfered = m_amts.bytes_sent;
	m_display_show_transfer_data = true;
	
	int8_t rssi;
	uint32_t err_code;
	
	err_code = sd_ble_gap_rssi_get(m_conn_handle, &rssi);
	if(err_code == NRF_SUCCESS)
	{
		if(m_rssi_data.nr_of_samples == 0)
		{
			m_rssi_data.moving_average = rssi;
		}
		else
		{
			m_rssi_data.moving_average = 
					(float)m_rssi_data.moving_average * RSSI_MOVING_AVERAGE_ALPHA
					+ (float)rssi * (1.0f - RSSI_MOVING_AVERAGE_ALPHA);
		}
		
		m_rssi_data.sum += rssi;
		m_rssi_data.nr_of_samples++;
		m_rssi_data.current_rssi = rssi;
		
		test_params_t test_params;
		get_test_params(&test_params);
		
		//check in case the RSSI value magically drops below the spec
		if( (-m_rssi_data.moving_average) > (test_params.link_budget - test_params.tx_power))
		{
			m_rssi_data.link_budget = 0;
		}
		else
		{
			m_rssi_data.link_budget = test_params.link_budget - test_params.tx_power + m_rssi_data.moving_average;
		}
		
		if(m_rssi_data.link_budget > m_rssi_data.link_budget_max)
        {
            m_rssi_data.link_budget_max = m_rssi_data.link_budget;
        }
		
		m_rssi_data.range_multiplier = pow(10.0, (double)m_rssi_data.link_budget/20.0);
	}
}

int main(void)
{
    log_init();
	
	display_init();
	
    leds_init();
    timer_init();
    counter_init();
	
	uint32_t err_code;
	err_code = app_timer_create(&m_display_timer_id, APP_TIMER_MODE_REPEATED, display_timer_handler);
	APP_ERROR_CHECK(err_code);
	
	buttons_init(buttons);
	buttons_enable();
	
    ble_stack_init();
	
	sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
	 
    gap_params_init();
    conn_params_init();
    gatt_init();
    advertising_data_set();

    server_init();
    client_init();

	test_params_t test_params;
	get_test_params(&test_params);

    gatt_mtu_set(test_params.att_mtu);
    data_len_ext_set(&test_params);
    conn_evt_len_ext_set(test_params.conn_evt_len_ext_enabled);
	
	tx_power_set(test_params.tx_power);
	
	//clear terminal screen and place cursor at top of page (works in putty, tera term and RTT viewer, does not work in termite)
	NRF_LOG_RAW_INFO("\033[2J\033[;H");
	
    NRF_LOG_RAW_INFO("Throughput demo started.\r\n");
    NRF_LOG_RAW_INFO("Press button 1 on the board connected to the PC.\r\n");
    NRF_LOG_RAW_INFO("Press button 2 on other board.\r\n");
    NRF_LOG_FLUSH();
	
	display_clear();
    display_print_line_inc("- Press button 1 on this board");
    display_print_line_inc("- Press button 2 on other board.");
	display_show();

    uint8_t button = button_read();

	if(button == BUTTON_1)
	{
		m_board_role = BOARD_TESTER;
		preferred_phy_set(test_params.rxtx_phy);
		m_print_menu = true;
	}
	else
	{
		m_board_role = BOARD_DUMMY;
		preferred_phy_set(BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_CODED);
		advertising_start();
	}

    for (;;)
    {
		if(m_transfer_done)
		{
			display_test_done_screen(&m_transfer_data, &m_rssi_data);
			
			button_read();
			m_transfer_done = false;
		}
		
        if (m_print_menu && !m_transfer_done)
        {
            menu_print();
        }

        if (is_test_ready())
        {
            m_run_test = true;
            test_run(!m_test_continuous);
        }

		if(m_display_show_transfer_data)
		{
			display_draw_test_run_screen(&m_transfer_data, &m_rssi_data);
			m_display_show_transfer_data = false;
		}
		
		if(m_display_show)
		{
			display_show();
			m_display_show = false;
		}
		
        if (!NRF_LOG_PROCESS())
        {
            wait_for_event();
        }
    }
}


/**
 * @}
 */
